cheatsheets/git-stack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Stack</title>
<meta name="description" content="notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="git-stack.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git Stack</h1>
<p>
Run <code>git stack</code> to see the trees. Then <code>git stack --dump-config -</code> to check the config
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>git config --global set stack.stack current</code></td>
<td class="org-left">Makes <code>git-stack</code> commands safer for random clones until they're configured.</td>
</tr>

<tr>
<td class="org-left"><code>git stack --protect develop</code></td>
<td class="org-left">Protect additional branches. On a team, you'll need branch naming patterns</td>
</tr>

<tr>
<td class="org-left"><code>git config set stack.stack dependents</code></td>
<td class="org-left">Limit the default scope of <code>git-stack</code> commands</td>
</tr>
</tbody>
</table>
<div id="outline-container-org7da8c75" class="outline-2">
<h2 id="org7da8c75">Stacking Modes</h2>
<div class="outline-text-2" id="text-org7da8c75">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Stack Type</th>
<th scope="col" class="org-left">Selector</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">current</td>
<td class="org-left">Branches in <code>BASE..HEAD</code></td>
<td class="org-left">Fairly useless</td>
</tr>

<tr>
<td class="org-left">dependents</td>
<td class="org-left">Branches in <code>BASE..HEAD..</code></td>
<td class="org-left">Runs up stack, listing refs depending on this branch/stack. Safe. Mostly useful if on a team</td>
</tr>

<tr>
<td class="org-left">descendants</td>
<td class="org-left">Branches in <code>BASE..</code></td>
<td class="org-left">Traces up stack &amp; down to their common ancestor. Limited by <code>protect-commit-age</code>. Less safe.</td>
</tr>

<tr>
<td class="org-left">all</td>
<td class="org-left">Show all branches</td>
<td class="org-left">Not really safe/useful for automation.</td>
</tr>
</tbody>
</table>

<p>
The <code>stack.stack</code> config will require using <code>git stack -s all</code> to get the pretty
tree back. This limits the scope of automation that <code>git-stack</code> can perform.
</p>

<p>
Next, ensure that each branch you care about has a <code>ref</code> set in
<code>branch.featname.merge</code>.
</p>
</div>
</div>
<div id="outline-container-orgdb351d8" class="outline-2">
<h2 id="orgdb351d8">Command</h2>
<div class="outline-text-2" id="text-orgdb351d8">
<p>
<code>git log --graph --all --oneline --decorate main..HEAD</code>
</p>

<p>
The main <code>git-stack</code> command is functionally equivalent to the above. It also
assumes user intent based on context.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Opt</th>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Values</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-r</code></td>
<td class="org-left"><code>--rebase</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Rebase the selected stacks</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--pull</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Pull the parent branch and rebase onto it</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--push</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Push all ready branches</td>
</tr>

<tr>
<td class="org-left"><code>-s</code></td>
<td class="org-left"><code>--stack</code></td>
<td class="org-left">all</td>
<td class="org-left">current,dependents,descendants</td>
<td class="org-left">Which branch stacks to include</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--base</code></td>
<td class="org-left"><code>$branch</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Branch to evaluate from. Default: most recent protected branch</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--onto</code></td>
<td class="org-left"><code>$base</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Branch to rebase onto</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--fixup</code></td>
<td class="org-left">ignore</td>
<td class="org-left">move,squash</td>
<td class="org-left">Action to perform with fixup-commits</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--repair</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Repair Diverging branch</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--format</code></td>
<td class="org-left">graph</td>
<td class="org-left">silent,list,debug</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--show-commits</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">none,unprotected,all</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--protected</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Show protected branches</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--protect</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>$branch</code></td>
<td class="org-left">Protect <code>$branch</code>'s that match <code>gitignore</code> syntax.</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--dump-config</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>$output_file</code></td>
<td class="org-left">Use <code>-</code> for stdout</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org17781dc" class="outline-3">
<h3 id="org17781dc">Actions</h3>
<div class="outline-text-3" id="text-org17781dc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action</th>
<th scope="col" class="org-left">Alternative</th>
<th scope="col" class="org-left">Benefit</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>--rebase</code></td>
<td class="org-left"><code>git rebase -i --autosquash master</code></td>
<td class="org-left">No need to manually select the base</td>
</tr>

<tr>
<td class="org-left"><code>--repair</code></td>
<td class="org-left"><code>repo forall</code> or raw bash</td>
<td class="org-left">Update dependent stacks of new commit(s) in their parent stack</td>
</tr>

<tr>
<td class="org-left"><code>--push</code></td>
<td class="org-left"><code>git push --set-upstream --force-with-lease origin $branch</code></td>
<td class="org-left">Prevents pushing branches if multi-stack or if include <code>WIP</code> commits</td>
</tr>
</tbody>
</table>

<p>
<code>git-stack --push</code> doesn't prevent pushing <code>fixup!</code> commits. to avoid that, use
the <code>commited</code> CLI tool
</p>
</div>
</div>
<div id="outline-container-orge1b7022" class="outline-3">
<h3 id="orge1b7022">Subcommands</h3>
<div class="outline-text-3" id="text-orge1b7022">
<p>
Auto-rebase will rebase child commits/branches, given the assumed stack logic
for a scope set by <code>-s $stack_type</code> or by <code>git config get stack.stack</code>.
</p>

<p>
Most commands don't offer <code>-s</code>, so choosing the correct project config is
necessary.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Subcommand</th>
<th scope="col" class="org-left">Alternative</th>
<th scope="col" class="org-left">Benefit</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">sync</td>
<td class="org-left"><code>git pull --rebase upstream main</code></td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">next</td>
<td class="org-left"><code>git stack &amp;&amp; git checkout $ref</code></td>
<td class="org-left">No need to copy <code>$ref</code></td>
</tr>

<tr>
<td class="org-left">previous</td>
<td class="org-left"><code>git stack &amp;&amp; git checkout $ref</code></td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">reword</td>
<td class="org-left"><code>git commit --amend</code></td>
<td class="org-left">Auto-rebase</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>git rebase -i $ref</code> then setting <code>r</code></td>
<td class="org-left">Auto-rebase. Less steps</td>
</tr>

<tr>
<td class="org-left">amend</td>
<td class="org-left"><code>git commit --amend --no-edit</code></td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">run</td>
<td class="org-left"><code>repo forall</code></td>
<td class="org-left">You probably don't have <code>repo</code> installed</td>
</tr>
</tbody>
</table>

<p>
Running <code>git-stack --rebase</code> will squash the <code>fixup!</code> commits, depending on
<code>stack.auto-fixup</code>.
</p>
</div>
<div id="outline-container-orgefd9fc5" class="outline-4">
<h4 id="orgefd9fc5">Global</h4>
<div class="outline-text-4" id="text-orgefd9fc5">
<p>
<code>git-stack sync</code> only takes these options, which apply to all subcommands.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Opt</th>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Default</th>
<th scope="col" class="org-left">Values</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-n</code></td>
<td class="org-left"><code>--dry-run</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Don't actually switch</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--color $when</code></td>
<td class="org-left">auto</td>
<td class="org-left">always,never</td>
<td class="org-left">Controls when to use color</td>
</tr>

<tr>
<td class="org-left"><code>-v</code></td>
<td class="org-left"><code>--verbose...</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Increase logging verbosity</td>
</tr>

<tr>
<td class="org-left"><code>-q</code></td>
<td class="org-left"><code>--quiet...</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Decrease logging verbosity</td>
</tr>

<tr>
<td class="org-left"><code>-h</code></td>
<td class="org-left"><code>--help</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Print help</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0a59a58" class="outline-4">
<h4 id="org0a59a58"><code>git-stack run</code></h4>
<div class="outline-text-4" id="text-org0a59a58">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Opt</th>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-s</code></td>
<td class="org-left"><code>--switch</code></td>
<td class="org-left">Switch to the first commit that fails</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--no-fail-fast</code></td>
<td class="org-left">Keep going</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3155a63" class="outline-4">
<h4 id="org3155a63"><code>git-stack {reword,amend}</code></h4>
<div class="outline-text-4" id="text-org3155a63">
<p>
<code>git-stack amend -m $message [OPTIONS] [REV]</code>
</p>

<p>
<code>git-stack reword -m $message [REV]</code>
</p>

<p>
Only <code>-m</code> is valid for reword.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Opt</th>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-a</code></td>
<td class="org-left"><code>--all</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Commit all changed files</td>
</tr>

<tr>
<td class="org-left"><code>-i</code></td>
<td class="org-left"><code>--interactive</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Interactively add changes</td>
</tr>

<tr>
<td class="org-left"><code>-e</code></td>
<td class="org-left"><code>--edit</code></td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Force edit of commit message</td>
</tr>

<tr>
<td class="org-left"><code>-m</code></td>
<td class="org-left"><code>--message</code></td>
<td class="org-left"><code>$MESSAGE</code></td>
<td class="org-left">Commit message</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcececb8" class="outline-4">
<h4 id="orgcececb8"><code>git-stack {next,previous}</code></h4>
<div class="outline-text-4" id="text-orgcececb8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Opt</th>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-b</code></td>
<td class="org-left"><code>--branch</code></td>
<td class="org-left">Jump directly to the previous branch</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--stash</code></td>
<td class="org-left">Stash prior to switch</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--oldest</code></td>
<td class="org-left">On ambiguity, select the oldest commit</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left"><code>--protected</code></td>
<td class="org-left">Traverse across protected commits</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
